In [1]:
import pandas as pd

In [2]:
file = "Resources/purchase_data.csv"

In [3]:
df = pd.read_csv(file)
df.head(1)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53

In [4]:
total_ID = df["SN"].unique()
myseries = pd.Series(total_ID)
counts = myseries.count()
counts
                     
player_count = [counts]
player_count_df = pd.DataFrame(player_count, columns = ["Total Players"])
player_count_df

   Total Players
0            576

In [5]:
unique_items_df = df["Item Name"].unique()
count_unique_items = pd.Series(unique_items_df).count()
count_unique_items

179

In [6]:
average_price = df["Price"].mean()
average_price_df = '{:.2f}'.format(average_price)
average_price_df

'3.05'

In [7]:
number_purchases = df["Purchase ID"].count()
number_purchases

780

In [8]:
total_revenue = df["Price"].sum()
total_revenue

2379.77

In [9]:
purchase_analysis = [{"Number of Unique Items" : count_unique_items,
                     "Average Price" : average_price_df,
                     "Number of Purchases" : number_purchases, 
                     "Total Revenue" : total_revenue
                    }]
purchase_analysis_df = pd.DataFrame(purchase_analysis)
                                                      
purchase_analysis_df

   Number of Unique Items Average Price  Number of Purchases  Total Revenue
0                     179          3.05                  780        2379.77

In [10]:
male = df.loc[df["Gender"] == "Male", :]
unique_male = male["SN"].unique()
male_series = pd.Series(unique_male)
unique_male_count = male_series.count()
unique_male_count # 484

female = df.loc[df["Gender"] == "Female", :]
unique_female = female["SN"].unique()
female_series = pd.Series(unique_female)
unique_female_count = female_series.count()
unique_female_count # 81

empty = df.loc[df["Gender"] != "Male", :]
unique_empty = empty["SN"].unique()
empty_series = pd.Series(unique_empty)
unique_empty_count = empty_series.count()
true_unique_empty_count = unique_empty_count - unique_female_count
true_unique_empty_count # 11

11

In [11]:
male_percentage = '{:.2f}'.format((unique_male_count / counts) * 100 )
male_percentage

'84.03'

In [12]:
female_percentage = '{:.2f}'.format(( unique_female_count / counts) * 100 )
female_percentage

'14.06'

In [13]:
empty_percentage = '{:.2f}'.format((true_unique_empty_count / counts) * 100 )
empty_percentage

'1.91'

In [14]:
gender_demographics = [{"Total Count" : unique_male_count,
                     "Percentage of Players" : male_percentage
                       },
                      {"Total Count" : unique_female_count,
                       "Percentage of Players" : female_percentage       
                      },
                       {"Total Count" : true_unique_empty_count,
                        "Percentage of Players" : empty_percentage
                       }]
                      
gender_demographics_df = pd.DataFrame(gender_demographics, index = ['Male', 'Female',
                                                                    'Other / Non-Disclosed'])
gender_demographics_df

                       Total Count Percentage of Players
Male                           484                 84.03
Female                          81                 14.06
Other / Non-Disclosed           11                  1.91

In [15]:
gender = df[["Gender", "Purchase ID"]]
gender_grouped = gender.groupby(["Gender"])
gender_grouped_count = gender_grouped.count()
sorted_gender_grouped_count = gender_grouped_count.sort_values("Purchase ID", ascending = False)
sorted_gender_grouped_count

                       Purchase ID
Gender
Male                           652
Female                         113
Other / Non-Disclosed           15

In [16]:
gender = df[["Gender", "Price"]]
gender_grouped2 = gender.groupby(["Gender"])
gender_grouped2_avr = round(gender_grouped2.mean(), 2)
sorted_gender_grouped2_avr = gender_grouped2_avr.sort_values("Price", ascending=True)
sorted_gender_grouped2_avr = sorted_gender_grouped2_avr.rename(columns={"Price":"Average Purchase Price"})
sorted_gender_grouped2_avr

                       Average Purchase Price
Gender
Male                                     3.02
Female                                   3.20
Other / Non-Disclosed                    3.35

In [17]:
gender = df[["Gender", "Price"]]
gender_grouped3 = gender.groupby(["Gender"])
gender_grouped3_sum = round(gender_grouped3.sum(), 2)
sorted_gender_grouped3_sum = gender_grouped3_sum.sort_values("Price", ascending=False)
sorted_gender_grouped3_sum = sorted_gender_grouped3_sum.rename(columns={"Price":"Total Purchase Value"})
sorted_gender_grouped3_sum

                       Total Purchase Value
Gender
Male                                1967.64
Female                               361.94
Other / Non-Disclosed                 50.19

In [18]:
male = df.loc[df["Gender"] == "Male", :]
male_grouped = male.groupby(["SN"])
male_grouped_price = male_grouped["Price"]
male_grouped_price_avr = round(male_grouped_price.sum().mean(),2)
# male_grouped_price_avr # 4.07

female = df[df["Gender"] == "Female"]
female_grouped = female.groupby(["SN"])
female_grouped_price = female_grouped["Price"]
female_grouped_price_avr = round(female_grouped_price.sum().mean(),2)
# female_grouped_price_avr # 4.47

non_gender = df[df["Gender"]== "Other / Non-Disclosed"]
non_gender_grouped = non_gender.groupby(["SN"])
non_gender_grouped_price = non_gender_grouped["Price"]
non_gender_grouped_price_avr = round(non_gender_grouped_price.sum().mean(),2)
# non_gender_grouped_price_avr # 4.56

In [19]:
avr_total_purchase_per_person = [{"Average Total Purchase Per Person": male_grouped_price_avr},
                                 {"Average Total Purchase Per Person": female_grouped_price_avr},
                                 {"Average Total Purchase Per Person":non_gender_grouped_price_avr    
                                 }]
avr_total_purchase_per_person_df = pd.DataFrame(avr_total_purchase_per_person, index=["Male", "Female", "Other / Non-Disclosed"])
avr_total_purchase_per_person_df

                       Average Total Purchase Per Person
Male                                                4.07
Female                                              4.47
Other / Non-Disclosed                               4.56

In [20]:
joined_df = pd.concat([sorted_gender_grouped_count, sorted_gender_grouped2_avr, 
                       sorted_gender_grouped3_sum, avr_total_purchase_per_person_df], axis=1)

In [21]:
joined_df["Average Purchase Price"] = '$' + joined_df["Average Purchase Price"].astype(str)
joined_df["Total Purchase Value"] = '$' + joined_df["Total Purchase Value"].astype(str)
joined_df["Average Total Purchase Per Person"] = '$' + joined_df["Average Total Purchase Per Person"].astype(str)

In [22]:
joined_df1 = joined_df.rename(columns={"Purchase ID":"Purchase Count"})

In [23]:
joined_df1

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase Per Person
Gender,,,,
Male,652,$3.02,$1967.64,$4.07
Female,113,$3.2,$361.94,$4.47
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [24]:
bins = [1, 9, 14, 19, 29, 39, 100] #  6 ranges
labels = ["<10", "10~14", "15~19", "20~29", "30~39", "40+"]
age_range = pd.cut(df["Age"], bins, labels=labels, include_lowest = True)
df["Age Group"] = age_range
df.head(1)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20~29

In [25]:
drop_duplicate_df = df.drop_duplicates(subset="SN", keep="first")

In [26]:
grouped_df_of_drop = drop_duplicate_df.groupby(["Age Group"])
number_age_group = grouped_df_of_drop["SN"].count()

In [27]:
total_number_age_group = number_age_group.sum()

In [28]:
percent_age_group = round((number_age_group/total_number_age_group) * 100, 2).astype(str) + '%'

In [29]:
merged_by_age_group = pd.merge(number_age_group, percent_age_group, on="Age Group")
renamed_merged_by_age_group = merged_by_age_group.rename(columns={"SN_x": "Total Count", "SN_y":"Age Group Percent"})
renamed_merged_by_age_group

           Total Count Age Group Percent
Age Group
<10                 17             2.95%
10~14               22             3.82%
15~19              107            18.58%
20~29              335            58.16%
30~39               83            14.41%
40+                 12             2.08%

In [32]:
# purchase count
grouped_all_df = df.groupby(["Age Group"])
purchase_count = grouped_all_df["Purchase ID"].count()
print(purchase_count)

# avg. purchase price
avg_purchase_price = '$' + round(grouped_all_df["Price"].mean(),2).astype(str)
print(avg_purchase_price)

# purchase total
grouped_age_group_per_person = df.groupby(["Age Group"]).sum()
price_grouped_age_group_per_person = round(grouped_age_group_per_person["Price"],2)
formatted_price_grouped_age_group_per_person = '$' + price_grouped_age_group_per_person.astype(str)
print(formatted_price_grouped_age_group_per_person)

total1 = renamed_merged_by_age_group["Total Count"]
# avg. purchase total per person
avg_purchase_total_per_person = '$' + round((price_grouped_age_group_per_person / total1),2).astype(str)
avg_purchase_total_per_person

Age Group
<10       23
10~14     28
15~19    136
20~29    466
30~39    114
40+       13
Name: Purchase ID, dtype: int64
Age Group
<10      $3.35
10~14    $2.96
15~19    $3.04
20~29    $3.02
30~39    $3.17
40+      $2.94
Name: Price, dtype: object
Age Group
<10        $77.13
10~14      $82.78
15~19     $412.89
20~29    $1407.06
30~39     $361.67
40+        $38.24
Name: Price, dtype: object

Age Group
<10      $4.54
10~14    $3.76
15~19    $3.86
20~29     $4.2
30~39    $4.36
40+      $3.19
dtype: object

In [33]:
merged_age_analysis = pd.merge(purchase_count, avg_purchase_price, on="Age Group")

In [34]:
age_merged_price_analysis = pd.merge(merged_age_analysis, formatted_price_grouped_age_group_per_person, on="Age Group")
age_merged_price_analysis["Avg Purchase Total Per Person"] = avg_purchase_total_per_person

In [35]:
age_merged_price_analysis
age_merged_price_analysis.rename(columns={"Price_x": "Avg Purchase Price", "Price_y":"Purchase Total"})

,Purchase ID,Avg Purchase Price,Purchase Total,Avg Purchase Total Per Person
Age Group,,,,
<10,23,$3.35,$77.13,$4.54
10~14,28,$2.96,$82.78,$3.76
15~19,136,$3.04,$412.89,$3.86
20~29,466,$3.02,$1407.06,$4.2
30~39,114,$3.17,$361.67,$4.36
40+,13,$2.94,$38.24,$3.19

In [36]:
# Run basic calculations to obtain the results in the table below
# Create a summary data frame to hold the results
# Sort the total purchase value column in descending order
# Optional: give the displayed data cleaner formatting
# Display a preview of the summary data frame

# Top Spenders

In [37]:
# purchase_count_per_person
grouped_sn_df = df.groupby(["SN"])
purchase_count_per_person = grouped_sn_df["Purchase ID"].count()
# print(purchase_count_per_person)

# Average Purchase Price
avr_purchase_price = '$' + round(grouped_sn_df["Price"].mean(),2).astype(str)
print(avr_purchase_price)

# Total Purchase Value
total_purchase_value = '$' + round(grouped_sn_df["Price"].sum(),2).astype(str)
print(total_purchase_value)

SN
Adairialis76     $2.28
Adastirin33      $4.48
Aeda94           $4.91
Aela59           $4.32
Aelaria33        $1.79
                 ...
Yathecal82       $2.07
Yathedeu43       $3.01
Yoishirrala98    $4.58
Zhisrisu83       $3.94
Zontibe81        $2.68
Name: Price, Length: 576, dtype: object
SN
Adairialis76     $2.28
Adastirin33      $4.48
Aeda94           $4.91
Aela59           $4.32
Aelaria33        $1.79
                 ...
Yathecal82       $6.22
Yathedeu43       $6.02
Yoishirrala98    $4.58
Zhisrisu83       $7.89
Zontibe81        $8.03
Name: Price, Length: 576, dtype: object

In [38]:
merged_top_purchase = pd.merge(purchase_count_per_person, avr_purchase_price, on ='SN')
renamed_merged_top_purchase = merged_top_purchase.rename(columns={"Price":"Avr Purchase Price"})

In [39]:
merged_renamed_merged_top_purchase = pd.merge(renamed_merged_top_purchase, total_purchase_value, on = 'SN')

In [40]:
merged_renamed_merged_top_purchase1 = merged_renamed_merged_top_purchase.rename(columns={"Price":"Total Purchase Value"}
                                                                               ).sort_values('Purchase ID', ascending= False)

In [41]:
merged_renamed_merged_top_purchase1

              Purchase ID Avr Purchase Price Total Purchase Value
SN
Lisosia93               5              $3.79               $18.96
Iral74                  4               $3.4               $13.62
Idastidru52             4              $3.86               $15.45
Asur53                  3              $2.48                $7.44
Inguron55               3               $3.7               $11.11
...                   ...                ...                  ...
Hala31                  1              $1.02                $1.02
Haisurra41              1               $4.4                 $4.4
Hailaphos89             1              $3.81                $3.81
Haestyphos66            1              $1.97                $1.97
Iskosian40              1              $3.07                $3.07

[576 rows x 3 columns]

In [42]:
# Create a summary data frame to hold the results
# Sort the purchase count column in descending order
# Optional: give the displayed data cleaner formatting
# Display a preview of the summary data frame

# Most Popular Items
df.head(1)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20~29

In [43]:
# Retrieve the Item ID, Item Name, and Item Price columns
item_df = df[["Item ID", "Item Name", "Price"]]
item_df.head(1)

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53

In [44]:
# Group by Item ID and Item Name.
grouped_item_df = item_df.groupby(["Item ID", "Item Name"])
# Perform calculations to obtain purchase count
count_grouped_item_df = grouped_item_df.count()
count_grouped_item_df.head(3)

                   Price
Item ID Item Name
0       Splinter       4
1       Crucifer       4
2       Verdict        6

In [45]:
# total purchase value
total_price_grouped_item_df = round(grouped_item_df.sum(),2)
formatted_total_price_grouped_item_df = '$' + round(total_price_grouped_item_df,2).astype(str)
total_price_grouped_item_df.head(1)

                   Price
Item ID Item Name
0       Splinter    5.12

In [46]:
# item price
item_price = '$' + round((total_price_grouped_item_df / count_grouped_item_df),2).astype(str)

In [47]:
merged_popular_items = pd.merge(count_grouped_item_df, item_price, on = ['Item ID', 'Item Name'])

In [48]:
merged_popular_items1 = pd.merge(merged_popular_items, formatted_total_price_grouped_item_df, on = ['Item ID', 'Item Name'])

In [49]:
merged_popular_items2 = merged_popular_items1.rename(columns={"Price_x":"Counts",
                                                             "Price_y":"Price of Item",
                                                             "Price": "Total"
                                                             })

In [50]:
sorted_merged_popular_items2 = merged_popular_items2.sort_values('Counts', ascending=False)

In [51]:
sorted_merged_popular_items2

,,Counts,Price of Item,Total
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
...,...,...,...,...
42,The Decapitator,1,$1.75,$1.75
51,Endbringer,1,$4.66,$4.66
118,"Ghost Reaver, Longsword of Magic",1,$2.17,$2.17
104,Gladiator's Glaive,1,$1.93,$1.93
91,Celeste,1,$4.17,$4.17

In [52]:
# Most Profitable Items
# Sort the above table by total purchase value in descending order
sorted_merged_popular_items2 # it is already in descending order
# Optional: give the displayed data cleaner formatting

# Display a preview of the data frame
sorted_merged_popular_items2.head(3)

,,Counts,Price of Item,Total
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22